# %%
import pandas as pd


# %%
s1=pd.Series([1,2,5,4,2,3,6,9,8,4,5,8,1,2,35,1])

# %%
len(s1)#len همه مقادیر را می شمارد حتی مقادیر خالی

# %%
s1.size#size همه مقادیر را می شمارد حتی مقادیر خالی

# %%
s1.count()#count   مقادیر خالی  را نمی شمارد 

# %%
s1.shape#shape همه مقادیر را می شمارد حتی مقادیر خالی

# %%
s2=pd.Series([1,2,5,4,None,3,6,9,8,4,8,5,None,2,35,1])

# %%
len(s2)#len همه مقادیر را می شمارد حتی مقادیر خالی

# %%
s2.size #size همه مقادیر را می شمارد حتی مقادیر خالی

# %%
s2.count()       #count مقادیر خالی را نمی شمارد

# %%
s1.values        #مقادیر متغیر را نشان میدهد

# %%
s2.values        #مقادیر متغیر را نشان میدهد

# %%
s3 = pd.Series(['A','B','C'])

# %%
s3

# %%
s3.values

# %%
s3.index

# %%
s4=pd.Series({'A': 1 ,'B': 2 , 'C': 5 , 'D' : 25 , 'E': 50})

# %%
s4

# %%
s4.values

# %%
s4.index

# %%
s1.is_unique

# %%
s1.is_monotonic_increasing      #بررسی کاهشی بودن مقادیر متغیر

# %%
s1.is_monotonic_decreasing       #بررسی افزایشی بودن مقادیر متغیر

# %%



