# %%
import pandas as pd

# %%
s1 = pd.Series([1,3,5,7,9])    #ساخت متغیر سری
s1


# %%
list(s1)    #تبدیل سری به لیست

# %%
dict(s1)    #تبدیل سری به دیکشنری

# %%
s1.values    #ساخت ارایه از سری 

# %%
import numpy as np    #فراخوانی نامپای

# %%
np.array(s1)    #ساخت ارایه از سری با استفاده از نامپای

# %%
tuple(s1)    #ساخت تاپل از سری 

# %%
s2 = pd.Series(data = [1,2,3,4,5,6],index=['A','B','C','D','E','F'])    #ساخت متغیر دوم سری
s2

# %%
dict(s2)

# %%
list(s2)

# %%
2 in s1    #بررسی شرط وجود 2 در اندیس  s1

# %%
2 in s1.index    #بررسی شرط وجود 2 در اندیس s1

# %%
2 in s1.values    #بررسی شرط وجود 2 در مقادیر s1

# %%



