# %%
import pandas as pd

# %%
s1=pd.Series([1,3,5,7,9,11,13,15,17,19])

# %%
s2=pd.Series([2,4,6,8,10,12])

# %%
s1+5    #جمع کردن عضو های یک سری با یک عدد

# %%
s1.add(5)    #جمع کردن عضو های یک سری با یک عدد با دستور add

# %%
s1+s2    #جمع کردن دو سری با هم

# %%
s1*s2    #ضرب کردن دو سری در هم

# %%
s1-3    #تفریق یک عدد از یک سری

# %%
s1.sub(3)    #تفریق یک عدد از یک سری

# %%
s1.subtract(3)    #تفریق یک عدد از یک سری

# %%
s1*3    #ضرب یک عدد در یک سری


# %%
s1.mul(3)    #ضرب یک عدد در یک سری

# %%
s1.multiply(3)    #ضرب یک عدد در یک سری

# %%
s1/2    #تقسیم یک سری بر یک عدد

# %%
s1.div(2)    #تقسیم یک سری بر یک عدد

# %%
s1.truediv(2)    #تقسیم یک سری بر یک عدد

# %%
s1.divide(2)    #تقسیم یک سری بر یک عدد

# %%
s1//2    #جزئ صحیح تقسیم یک سری بر یک عدد

# %%
s1.floordiv(2)    #جزئ صحیح تقسیم یک سری بر یک عدد

# %%
s1%3    #باقیمانده تقسیم سری بر عدد 3

# %%
s1.mod(3)    #باقیمانده تقسیم سری بر عدد 3

# %%
s1.pow(2)    #به توان رساندن یک سری

# %%
s1.radd(s2,fill_value =0)    #جمع کردن دو سری با دستور raddیعنی معکوس جمع 

# %%
s1

# %%
s1.rsub(s2)    #تفریق دو سری با دستور معکوس تفریق

# %%
s1/3

# %%
(s1/3).round()    #رند کردن اعداد

# %%



